In [1]:
import pandas as pd
import numpy as np

In [2]:
sozlukVerisi = {"Nigde" : [30,29,np.nan],"Ankara" : [20,np.nan,25],"Izmir" : [40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [3]:
havaDurumuDataFrame

   Nigde  Ankara  Izmir
0   30.0    20.0     40
1   29.0     NaN     39
2    NaN    25.0     38

In [4]:
havaDurumuDataFrame.dropna()

   Nigde  Ankara  Izmir
0   30.0    20.0     40

In [5]:
havaDurumuDataFrame

   Nigde  Ankara  Izmir
0   30.0    20.0     40
1   29.0     NaN     39
2    NaN    25.0     38

In [10]:
havaDurumuDataFrame.dropna(axis = 1)#axis sıfır dersek sıralar bir dersek kolonlar

   Izmir
0     40
1     39
2     38

In [11]:
yeniVeri = {"Nigde" : [30,29,np.nan],"Ankara" : [20,np.nan,25],"Izmir" : [40,39,38],"Antalya":[45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [12]:
yeniDataFrame

   Nigde  Ankara  Izmir  Antalya
0   30.0    20.0     40     45.0
1   29.0     NaN     39      NaN
2    NaN    25.0     38      NaN

In [13]:
yeniDataFrame.dropna(axis=1,thresh=2)

   Nigde  Ankara  Izmir
0   30.0    20.0     40
1   29.0     NaN     39
2    NaN    25.0     38

In [14]:
yeniDataFrame

   Nigde  Ankara  Izmir  Antalya
0   30.0    20.0     40     45.0
1   29.0     NaN     39      NaN
2    NaN    25.0     38      NaN

In [15]:
yeniDataFrame.fillna(15)

   Nigde  Ankara  Izmir  Antalya
0   30.0    20.0     40     45.0
1   29.0    15.0     39     15.0
2   15.0    25.0     38     15.0

GroupBy

In [16]:
maasSozlugu = {"Departman" : ["Yazılım","Yazılım","Doktor","Doktor","Hukuk","Hukuk"],
              "Calisan Ismi" : ["Celal","MuyuX","Deniz","Ceren","Yunus","Sila"],
               "Maas" : [100,150,200,300,400,500]
              }

In [17]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [18]:
maasDataFrame

  Departman Calisan Ismi  Maas
0   Yazılım        Celal   100
1   Yazılım        MuyuX   150
2    Doktor        Deniz   200
3    Doktor        Ceren   300
4     Hukuk        Yunus   400
5     Hukuk         Sila   500

In [19]:
grupObjesi = maasDataFrame.groupby("Departman")

In [20]:
grupObjesi.count()

           Calisan Ismi  Maas
Departman
Doktor                2     2
Hukuk                 2     2
Yazılım               2     2

In [21]:
grupObjesi.mean()

            Maas
Departman
Doktor     250.0
Hukuk      450.0
Yazılım    125.0

In [22]:
grupObjesi.min()

          Calisan Ismi  Maas
Departman
Doktor           Ceren   200
Hukuk             Sila   400
Yazılım          Celal   100

In [23]:
grupObjesi.max()

          Calisan Ismi  Maas
Departman
Doktor           Deniz   300
Hukuk            Yunus   500
Yazılım          MuyuX   150

In [24]:
grupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Doktor      2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0